Autodesk.Revit.DB.ViewSheet.CanBeDuplicated(Autodesk.Revit.DB.SheetDuplicateOption)
Identifies if this sheet can be duplicated.
duplicateOption:
The option to use when duplicating the sheet.
Returns:
True if the sheet can be duplicated, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2023

Autodesk.Revit.DB.ViewSheet.Duplicate(Autodesk.Revit.DB.SheetDuplicateOption)
Duplicates this sheet to generate a new one.
duplicateOption:
The option to use when duplicating the sheet.
Returns:
The id of the newly created sheet.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Sheet cannot be duplicated
Since:
2023

Autodesk.Revit.DB.ViewSheet.DeleteViewport(Autodesk.Revit.DB.Viewport)
Removes a viewport from the sheet by deleting it from the document.
viewport:
The viewport that will be deleted and removed from the sheet.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ViewSheet.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a new ViewSheet.
document:
The document to which the ViewSheet will be added.
titleBlockTypeId:
The type id of the TitleBlock type which will be used by the new ViewSheet.
For no TitleBlock, pass invalid element ID.
Returns:
The new ViewSheet.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId titleBlockTypeId does not correspond to a TitleBlock type.
-or-
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ViewSheet.CreatePlaceholder(Autodesk.Revit.DB.Document)
Creates a placeholder sheet in a document.
Remarks:
Placeholder sheets represent sheets stored outside of the Revit model,
but which should be organized along with the Revit sheets.
aDoc:
The document.
Returns:
The placeholder sheet.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.ViewSheet.SetAdditionalRevisionIds(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Sets the Revisions to additionally include in the sheet's revision schedules.
Remarks:
Additionally included Revisions will always participate in the sheet's revision schedules.
Normally a Revision is scheduled in the revision schedule because one of its associated RevisionClouds
is present on the sheet.
The additional project revision ids setting corresponds to the sheet's Revisions On Sheet parameter.
projectRevisionIds:
The ids of Revisions to explicitly include in the sheet's revision schedules.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more ElementIds in projectRevisionIds do not correspond to a Revision element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.ViewSheet.GetAdditionalRevisionIds
Gets the Revisions that are additionally included in the sheet's revision schedules.
Remarks:
Revisions in the sheet's additional project revisions set will appear in revisions schedules
even if no RevisionCloud belonging to that Revision is visible on the sheet.
These ids correspond to the Revisions that are explicitly included on the sheet via the
Revisions On Sheet parameter.
Returns:
The additionally included Revisions for the sheet's revision schedules.
Since:
2015

Autodesk.Revit.DB.ViewSheet.GetAllRevisionCloudIds
Gets the ids of the revision clouds which appear on the sheet's revision schedules.
Remarks:
The sheet's revision schedules include the revisions that are associated with revision clouds that are visible on the sheet.
Revision schedules may also include revisions that have been additionally added to the sheet via the Revisions On Sheets parameter.
Use Autodesk.Revit.DB.ViewSheet.GetAdditionalRevisionIds to get the additionally added revisions.
Returns:
The ids of the revisions clouds which appear on the sheet's revision schedules.
Since:
2023.1

Autodesk.Revit.DB.ViewSheet.GetRevisionCloudNumberOnSheet(Autodesk.Revit.DB.ElementId)
Gets the Revision Number for a RevisionCloud on this sheet.
Remarks:
Returns null if the RevisionCloud or its associated Revision do not appear on this sheet. The Revision Number for
a RevisionCloud will always be the same as the Revision Number of the associated Revision.
revisionCloudId:
The id of the RevisionCLoud.
Returns:
Returns the Revision Number as it will appear on this sheet or null if there is no Revision Number assigned on this sheet.
Throws Autodesk.Revit.Exceptions.ArgumentException:
revisionCloudId is not the Id of a RevisionCloud.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.ViewSheet.GetRevisionNumberOnSheet(Autodesk.Revit.DB.ElementId)
Gets the Revision Number for a particular Revision as it will appear on this sheet.
Remarks:
Returns null if the Revision does not appear on this sheet.
revisionId:
The id of the Revision.
Returns:
Returns the Revision Number as it will appear on this sheet or null if the Revision does not appear on this sheet.
Throws Autodesk.Revit.Exceptions.ArgumentException:
revisionId is not a valid Revision.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.ViewSheet.ConvertToRealSheet(Autodesk.Revit.DB.ElementId)
Converts a placeholder sheet to a real one with an optional titleblock.
titleBlockTypeId:
The id of the placeholder sheet, or invalidElementId if no titleblock should be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
titleBlockTypeId does not correspond to a TitleBlock type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This method may only be called on a placeholder sheet.
-or-
Failed to convert the sheet because the input titleblock could not be applied.
Since:
2011

Autodesk.Revit.DB.ViewSheet.SheetNumber
The sheet number of the document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: sheetNumber is an empty string or contains only whitespace.
-or-
When setting this property: sheetNumber cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
When setting this property: Sheet number is already in use.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null